# Pandas Join() Method
* other
* how
  * left
  * right
  * outer
  * inner
* suffix
    * lsuffix
    * rsuffix

### Import library

In [2]:
import pandas as pd

### Create two DataFrame

In [3]:
df1 = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                    'B': [10, 20 ,30, 40, 50]})
df1

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [4]:
df2 = pd.DataFrame({'C': [6, 7, 8, 9, 10],
                    'D': [60, 70, 80, 90, 100]})
df2

    C    D
0   6   60
1   7   70
2   8   80
3   9   90
4  10  100

## Join two DataFrame
By using join function we can join our dataset like:

In [5]:
df = df1.join(df2)
df

   A   B   C    D
0  1  10   6   60
1  2  20   7   70
2  3  30   8   80
3  4  40   9   90
4  5  50  10  100

In [6]:
df = df2.join(df1)
df

    C    D  A   B
0   6   60  1  10
1   7   70  2  20
2   8   80  3  30
3   9   90  4  40
4  10  100  5  50

### how
bu using this parameters we how the data join

In [7]:
df1

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [8]:
df2 = pd.DataFrame({'C': [6, 7, 8],
                    'D': [60, 70, 80]})
df2

   C   D
0  6  60
1  7  70
2  8  80

#### how = left
By default it's left

In [9]:
df = df1.join(df2, how = 'left')             
df

   A   B    C     D
0  1  10  6.0  60.0
1  2  20  7.0  70.0
2  3  30  8.0  80.0
3  4  40  NaN   NaN
4  5  50  NaN   NaN

#### how = right
It's join on the basis of right dataFrame lenght

In [10]:
df = df1.join(df2, how = 'right')         
df

   A   B  C   D
0  1  10  6  60
1  2  20  7  70
2  3  30  8  80

#### how = outer
it join all the DataFrame

In [11]:
df = df1.join(df2, how = 'outer')       
df

   A   B    C     D
0  1  10  6.0  60.0
1  2  20  7.0  70.0
2  3  30  8.0  80.0
3  4  40  NaN   NaN
4  5  50  NaN   NaN

#### how = inner
it's join on the basis of common lenght

In [12]:
df = df1.join(df2, how = 'inner')          
df

   A   B  C   D
0  1  10  6  60
1  2  20  7  70
2  3  30  8  80

### If we have same col name

In [33]:
df1 = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                    'B': [10, 20 ,30, 40, 50]})
df1

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [34]:
df2 = pd.DataFrame({'A': [6, 7, 8, 9, 10],
                    'B': [60, 70, 80, 90, 100]})
df2

    A    B
0   6   60
1   7   70
2   8   80
3   9   90
4  10  100

#### lsuffix
It will rename of left DataFrame

In [13]:
df = df1.join(df2, lsuffix = '1')
df

   A   B    C     D
0  1  10  6.0  60.0
1  2  20  7.0  70.0
2  3  30  8.0  80.0
3  4  40  NaN   NaN
4  5  50  NaN   NaN

#### rsuffix
It will rename of right DataFrame

In [14]:
df = df1.join(df2, rsuffix = '1')
df

   A   B    C     D
0  1  10  6.0  60.0
1  2  20  7.0  70.0
2  3  30  8.0  80.0
3  4  40  NaN   NaN
4  5  50  NaN   NaN